Disk/logs.txt
iiitb@iiitb-vm:~/Disk$ ./run_experiment.sh rand
===== BASELINE RUN =====
[+] Resetting system...
[+] System reset complete.
[+] Starting monitoring...
[+] Collecting system metadata...
[+] Running workload...
[+] Running workload: rand
[+] Creating large test file...
4000317440 bytes (4.0 GB, 3.7 GiB) copied, 13 s, 302 MB/s
4096+0 records in
4096+0 records out
4294967296 bytes (4.3 GB, 4.0 GiB) copied, 13.7762 s, 312 MB/s
rand_read: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.36
Starting 4 processes
Jobs: 4 (f=4): [r(4)][100.0%][r=6374KiB/s][r=1593 IOPS][eta 00m:00s]
rand_read: (groupid=0, jobs=4): err= 0: pid=210229: Sun Apr 26 17:16:59 2026
  read: IOPS=2047, BW=8189KiB/s (8385kB/s)(721MiB/90163msec)
    slat (usec): min=4, max=2746.1k, avg=1919.84, stdev=17898.02
    clat (msec): min=13, max=4072, avg=121.66, stdev=179.26
     lat (msec): min=15, max=4072, avg=123.58, stdev=181.01
    clat percentiles (msec):
     |  1.00th=[   41],  5.00th=[   55], 10.00th=[   65], 20.00th=[   75],
     | 30.00th=[   84], 40.00th=[   91], 50.00th=[   99], 60.00th=[  108],
     | 70.00th=[  120], 80.00th=[  136], 90.00th=[  167], 95.00th=[  201],
     | 99.00th=[  518], 99.50th=[ 1062], 99.90th=[ 3071], 99.95th=[ 3104],
     | 99.99th=[ 3943]
   bw (  KiB/s): min=   88, max=14601, per=100.00%, avg=8791.99, stdev=804.31, samples=671
   iops        : min=   22, max= 3650, avg=2197.81, stdev=201.08, samples=671
  lat (msec)   : 20=0.01%, 50=3.16%, 100=48.62%, 250=45.99%, 500=1.18%
  lat (msec)   : 750=0.31%, 1000=0.18%, 2000=0.28%, >=2000=0.27%
  cpu          : usr=0.52%, sys=1.84%, ctx=93202, majf=0, minf=302
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=184576,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=8189KiB/s (8385kB/s), 8189KiB/s-8189KiB/s (8385kB/s-8385kB/s), io=721MiB (756MB), run=90163-90163msec

Disk stats (read/write):
  sda: ios=184616/216, sectors=1477280/1125176, merge=43/137, ticks=11126345/18707, in_queue=11145052, util=97.53%
[+] Workload completed.
[+] Stopping monitoring...
[+] Cleaning logs...
[+] Done. Logs in run_before
Enter baseline directory path: [DEBUG] iostat columns: ['Device', 'r/s', 'rMB/s', 'rrqm/s', '%rrqm', 'r_await', 'rareq-sz', 'w/s', 'wMB/s', 'wrqm/s', '%wrqm', 'w_await', 'wareq-sz', 'd/s', 'dMB/s', 'drqm/s', '%drqm', 'd_await', 'dareq-sz', 'f/s', 'f_await', 'aqu-sz', '%util']

[+] Features extracted:
avg_await: 173.29
avg_queue: 94.11
avg_util: 91.32
avg_iops: 1571.23
avg_throughput_kBps: 42068.0
avg_iowait: 40.09
avg_req_size: 6.77
write_ratio: 0.15
top_io_process: node
top_io_kB: 6417951516.0
psi_some_avg10: 62.81
disk_pressure_score: 76.21
===== TUNING =====
Enter disk device (e.g., sda, nvme0n1): Enter feature JSON path: 
===== Tuning Decision =====

Detected Workload: random

Commands:
echo mq-deadline | sudo tee /sys/block/sda/queue/scheduler
sudo blockdev --setra 128 /dev/sda
Apply tuning manually and press ENTER

===== TUNED RUN =====
[+] Resetting system...
[+] System reset complete.
[+] Starting monitoring...
[+] Collecting system metadata...
[+] Running workload...
[+] Running workload: rand
rand_read: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.36
Starting 4 processes
Jobs: 4 (f=4): [r(4)][100.0%][r=13.3MiB/s][r=3412 IOPS][eta 00m:00s]
rand_read: (groupid=0, jobs=4): err= 0: pid=211798: Sun Apr 26 17:19:26 2026
  read: IOPS=2801, BW=10.9MiB/s (11.5MB/s)(986MiB/90124msec)
    slat (usec): min=4, max=12528, avg=507.34, stdev=1055.96
    clat (usec): min=1859, max=672719, avg=90845.34, stdev=53355.13
     lat (usec): min=1908, max=674487, avg=91352.69, stdev=53410.25
    clat percentiles (msec):
     |  1.00th=[   18],  5.00th=[   27], 10.00th=[   34], 20.00th=[   47],
     | 30.00th=[   60], 40.00th=[   72], 50.00th=[   85], 60.00th=[   97],
     | 70.00th=[  110], 80.00th=[  125], 90.00th=[  146], 95.00th=[  180],
     | 99.00th=[  275], 99.50th=[  342], 99.90th=[  481], 99.95th=[  523],
     | 99.99th=[  558]
   bw (  KiB/s): min= 5232, max=15000, per=100.00%, avg=11212.41, stdev=515.90, samples=718
   iops        : min= 1308, max= 3750, avg=2802.82, stdev=128.98, samples=718
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.02%, 20=1.74%, 50=20.84%
  lat (msec)   : 100=39.79%, 250=36.16%, 500=1.37%, 750=0.08%
  cpu          : usr=0.81%, sys=2.65%, ctx=154341, majf=0, minf=292
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=252464,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=10.9MiB/s (11.5MB/s), 10.9MiB/s-10.9MiB/s (11.5MB/s-11.5MB/s), io=986MiB (1034MB), run=90124-90124msec

Disk stats (read/write):
  sda: ios=252384/127, sectors=2020584/2776, merge=188/67, ticks=22846144/3268, in_queue=22849413, util=95.45%
[+] Workload completed.
[+] Stopping monitoring...
[+] Cleaning logs...
[+] Done. Logs in run_after
Enter baseline directory path: [DEBUG] iostat columns: ['Device', 'r/s', 'rMB/s', 'rrqm/s', '%rrqm', 'r_await', 'rareq-sz', 'w/s', 'wMB/s', 'wrqm/s', '%wrqm', 'w_await', 'wareq-sz', 'd/s', 'dMB/s', 'drqm/s', '%drqm', 'd_await', 'dareq-sz', 'f/s', 'f_await', 'aqu-sz', '%util']

[+] Features extracted:
avg_await: 48.04
avg_queue: 235.57
avg_util: 91.45
avg_iops: 2609.18
avg_throughput_kBps: 10665.44
avg_iowait: 15.73
avg_req_size: 5.34
write_ratio: 0.0
top_io_process: node
top_io_kB: 4105369840.0
psi_some_avg10: 20.63
disk_pressure_score: 105.38
Enter BEFORE directory path: Enter AFTER directory path: [+] Plots saved in comparison_plots/
DONE
iiitb@iiitb-vm:~/Disk$ ./run_experiment.sh seq
===== BASELINE RUN =====
[+] Resetting system...
[+] System reset complete.
[+] Starting monitoring...
[+] Collecting system metadata...
[+] Running workload...
[+] Running workload: seq
seq_read: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=64
...
fio-3.36
Starting 2 processes
Jobs: 2 (f=2): [R(2)][100.0%][r=758MiB/s][r=758 IOPS][eta 00m:00s]
seq_read: (groupid=0, jobs=2): err= 0: pid=213352: Sun Apr 26 17:23:14 2026
  read: IOPS=424, BW=424MiB/s (445MB/s)(37.3GiB/90142msec)
    slat (usec): min=45, max=4801.8k, avg=4581.17, stdev=56852.15
    clat (msec): min=46, max=12887, avg=296.94, stdev=780.31
     lat (msec): min=48, max=12902, avg=301.52, stdev=785.12
    clat percentiles (msec):
     |  1.00th=[   58],  5.00th=[   67], 10.00th=[   74], 20.00th=[   85],
     | 30.00th=[   94], 40.00th=[  104], 50.00th=[  113], 60.00th=[  124],
     | 70.00th=[  140], 80.00th=[  176], 90.00th=[  393], 95.00th=[ 1234],
     | 99.00th=[ 4077], 99.50th=[ 5738], 99.90th=[ 8356], 99.95th=[ 9731],
     | 99.99th=[12818]
   bw (  KiB/s): min=12288, max=862208, per=100.00%, avg=534750.65, stdev=119324.20, samples=292
   iops        : min=   12, max=  842, avg=522.09, stdev=116.49, samples=292
  lat (msec)   : 50=0.04%, 100=36.20%, 250=51.12%, 500=3.64%, 750=1.55%
  lat (msec)   : 1000=1.53%, 2000=3.02%, >=2000=2.91%
  cpu          : usr=0.27%, sys=2.86%, ctx=16368, majf=0, minf=32792
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.7%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=38242,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=424MiB/s (445MB/s), 424MiB/s-424MiB/s (445MB/s-445MB/s), io=37.3GiB (40.1GB), run=90142-90142msec

Disk stats (read/write):
  sda: ios=59732/142, sectors=78294072/2752, merge=121/93, ticks=11056852/87583, in_queue=11144435, util=94.28%
[+] Workload completed.
[+] Stopping monitoring...
[+] Cleaning logs...
[+] Done. Logs in run_before
Enter baseline directory path: [DEBUG] iostat columns: ['Device', 'r/s', 'rMB/s', 'rrqm/s', '%rrqm', 'r_await', 'rareq-sz', 'w/s', 'wMB/s', 'wrqm/s', '%wrqm', 'w_await', 'wareq-sz', 'd/s', 'dMB/s', 'drqm/s', '%drqm', 'd_await', 'dareq-sz', 'f/s', 'f_await', 'aqu-sz', '%util']

[+] Features extracted:
avg_await: 231.19
avg_queue: 117.3
avg_util: 90.38
avg_iops: 692.28
avg_throughput_kBps: 448592.97
avg_iowait: 26.59
avg_req_size: 597.48
write_ratio: 0.0
top_io_process: node
top_io_kB: 3751062361.02
psi_some_avg10: 60.78
disk_pressure_score: 79.78
===== TUNING =====
Enter disk device (e.g., sda, nvme0n1): Enter feature JSON path: 
===== Tuning Decision =====

Detected Workload: sequential

Commands:
echo mq-deadline | sudo tee /sys/block/sda/queue/scheduler
sudo blockdev --setra 1024 /dev/sda
Apply tuning manually and press ENTER

===== TUNED RUN =====
[+] Resetting system...
[+] System reset complete.
[+] Starting monitoring...
[+] Collecting system metadata...
[+] Running workload...
[+] Running workload: seq
seq_read: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=64
...
fio-3.36
Starting 2 processes
Jobs: 2 (f=2): [R(2)][100.0%][r=748MiB/s][r=748 IOPS][eta 00m:00s]
seq_read: (groupid=0, jobs=2): err= 0: pid=214691: Sun Apr 26 17:30:02 2026
  read: IOPS=707, BW=707MiB/s (741MB/s)(62.3GiB/90257msec)
    slat (usec): min=41, max=5831, avg=140.04, stdev=86.76
    clat (msec): min=40, max=712, avg=180.80, stdev=53.60
     lat (msec): min=41, max=712, avg=180.94, stdev=53.60
    clat percentiles (msec):
     |  1.00th=[   87],  5.00th=[  138], 10.00th=[  157], 20.00th=[  161],
     | 30.00th=[  163], 40.00th=[  165], 50.00th=[  167], 60.00th=[  171],
     | 70.00th=[  176], 80.00th=[  188], 90.00th=[  222], 95.00th=[  279],
     | 99.00th=[  397], 99.50th=[  550], 99.90th=[  609], 99.95th=[  642],
     | 99.99th=[  693]
   bw (  KiB/s): min=389120, max=817152, per=100.00%, avg=724649.14, stdev=47221.08, samples=360
   iops        : min=  380, max=  798, avg=707.60, stdev=46.11, samples=360
  lat (msec)   : 50=0.03%, 100=1.48%, 250=91.20%, 500=6.62%, 750=0.67%
  cpu          : usr=0.53%, sys=5.59%, ctx=57585, majf=0, minf=32792
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=63815,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=707MiB/s (741MB/s), 707MiB/s-707MiB/s (741MB/s-741MB/s), io=62.3GiB (66.9GB), run=90257-90257msec

Disk stats (read/write):
  sda: ios=103574/127, sectors=130574824/2872, merge=6236/83, ticks=18480083/10991, in_queue=18491074, util=90.20%
[+] Workload completed.
[+] Stopping monitoring...
[+] Cleaning logs...
[+] Done. Logs in run_after
Enter baseline directory path: [DEBUG] iostat columns: ['Device', 'r/s', 'rMB/s', 'rrqm/s', '%rrqm', 'r_await', 'rareq-sz', 'w/s', 'wMB/s', 'wrqm/s', '%wrqm', 'w_await', 'wareq-sz', 'd/s', 'dMB/s', 'drqm/s', '%drqm', 'd_await', 'dareq-sz', 'f/s', 'f_await', 'aqu-sz', '%util']

[+] Features extracted:
avg_await: 98.49
avg_queue: 193.02
avg_util: 86.28
avg_iops: 1084.64
avg_throughput_kBps: 681746.99
avg_iowait: 7.72
avg_req_size: 599.07
write_ratio: 0.0
top_io_process: node
top_io_kB: 3222213503.96
psi_some_avg10: 22.37
disk_pressure_score: 89.81
Enter BEFORE directory path: Enter AFTER directory path: [+] Plots saved in comparison_plots/
DONE

iiitb@iiitb-vm:~/Disk$ rm -rf run_before run_after
iiitb@iiitb-vm:~/Disk$ ./run_experiment.sh mix
===== BASELINE RUN =====
[+] Resetting system...
[sudo] password for iiitb: 
[+] System reset complete.
[+] Starting monitoring...
[+] Collecting system metadata...
[+] Running workload...
[+] Running workload: mix
rand_mix: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.36
Starting 4 processes
Jobs: 4 (f=4): [m(4)][2.8%][r=8KiB/s,w=8KiB/s][r=2,w=2 IOPS][eta 53m:24s]             
rand_mix: (groupid=0, jobs=4): err= 0: pid=222680: Sun Apr 26 17:54:28 2026
  read: IOPS=900, BW=3603KiB/s (3690kB/s)(328MiB/93207msec)
    slat (usec): min=4, max=5515.0k, avg=2863.14, stdev=57004.13
    clat (usec): min=862, max=16092k, avg=191261.43, stdev=727287.79
     lat (usec): min=1100, max=16171k, avg=194124.57, stdev=736564.81
    clat percentiles (msec):
     |  1.00th=[   32],  5.00th=[   44], 10.00th=[   51], 20.00th=[   60],
     | 30.00th=[   67], 40.00th=[   73], 50.00th=[   81], 60.00th=[   90],
     | 70.00th=[  106], 80.00th=[  144], 90.00th=[  232], 95.00th=[  347],
     | 99.00th=[ 3373], 99.50th=[ 6477], 99.90th=[10805], 99.95th=[11476],
     | 99.99th=[15905]
   bw (  KiB/s): min=   29, max=12632, per=100.00%, avg=5049.99, stdev=1029.38, samples=531
   iops        : min=    5, max= 3158, avg=1262.38, stdev=257.37, samples=531
  write: IOPS=389, BW=1558KiB/s (1595kB/s)(142MiB/93207msec); 0 zone resets
    slat (usec): min=5, max=5478.8k, avg=3496.85, stdev=65767.68
    clat (msec): min=10, max=18838, avg=204.58, stdev=804.50
     lat (msec): min=10, max=18845, avg=208.08, stdev=816.40
    clat percentiles (msec):
     |  1.00th=[   25],  5.00th=[   36], 10.00th=[   43], 20.00th=[   51],
     | 30.00th=[   57], 40.00th=[   63], 50.00th=[   69], 60.00th=[   77],
     | 70.00th=[   88], 80.00th=[  133], 90.00th=[  275], 95.00th=[  439],
     | 99.00th=[ 4396], 99.50th=[ 7013], 99.90th=[11342], 99.95th=[11476],
     | 99.99th=[16308]
   bw (  KiB/s): min=   29, max= 5752, per=100.00%, avg=2250.57, stdev=444.62, samples=515
   iops        : min=    5, max= 1438, avg=562.52, stdev=111.18, samples=515
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 10=0.01%, 20=0.14%, 50=12.29%, 100=57.10%
  lat (msec)   : 250=20.79%, 500=6.41%, 750=0.98%, 1000=0.22%, 2000=0.66%
  lat (msec)   : >=2000=1.42%
  cpu          : usr=0.33%, sys=1.10%, ctx=60233, majf=0, minf=54
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=83965,36294,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=3603KiB/s (3690kB/s), 3603KiB/s-3603KiB/s (3690kB/s-3690kB/s), io=328MiB (344MB), run=93207-93207msec
  WRITE: bw=1558KiB/s (1595kB/s), 1558KiB/s-1558KiB/s (1595kB/s-1595kB/s), io=142MiB (149MB), run=93207-93207msec

Disk stats (read/write):
  sda: ios=84021/36418, sectors=684392/293240, merge=86/115, ticks=6897222/3229216, in_queue=10126437, util=96.43%
[+] Workload completed.
[+] Stopping monitoring...
[+] Cleaning logs...
[+] Done. Logs in run_before
Enter baseline directory path: [DEBUG] iostat columns: ['Device', 'r/s', 'rMB/s', 'rrqm/s', '%rrqm', 'r_await', 'rareq-sz', 'w/s', 'wMB/s', 'wrqm/s', '%wrqm', 'w_await', 'wareq-sz', 'd/s', 'dMB/s', 'drqm/s', '%drqm', 'd_await', 'dareq-sz', 'f/s', 'f_await', 'aqu-sz', '%util']

[+] Features extracted:
avg_await: 369.86
avg_queue: 102.65
avg_util: 88.96
avg_iops: 1466.06
avg_throughput_kBps: 6495.91
avg_iowait: 46.15
avg_req_size: 12.35
write_ratio: 0.28
top_io_process: node
top_io_kB: 2355211376.0
psi_some_avg10: 64.71
disk_pressure_score: 79.65
===== TUNING =====
Enter disk device (e.g., sda, nvme0n1): Enter feature JSON path: 
===== Tuning Decision =====

Detected Workload: mixed

Commands:
echo mq-deadline | sudo tee /sys/block/sda/queue/scheduler
sudo blockdev --setra 512 /dev/sda
Apply tuning manually and press ENTER

===== TUNED RUN =====
[+] Resetting system...
[+] System reset complete.
[+] Starting monitoring...
[+] Collecting system metadata...
[+] Running workload...
[+] Running workload: mix
rand_mix: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.36
Starting 4 processes
Jobs: 4 (f=4): [m(4)][100.0%][r=1249KiB/s,w=500KiB/s][r=312,w=125 IOPS][eta 00m:00s]  
rand_mix: (groupid=0, jobs=4): err= 0: pid=224234: Sun Apr 26 17:56:54 2026
  read: IOPS=1062, BW=4252KiB/s (4354kB/s)(377MiB/90689msec)
    slat (usec): min=5, max=873726, avg=1105.76, stdev=8416.10
    clat (usec): min=686, max=2807.5k, avg=178284.91, stdev=238195.96
     lat (usec): min=726, max=2809.3k, avg=179390.66, stdev=238997.32
    clat percentiles (msec):
     |  1.00th=[   16],  5.00th=[   27], 10.00th=[   36], 20.00th=[   51],
     | 30.00th=[   66], 40.00th=[   81], 50.00th=[   97], 60.00th=[  120],
     | 70.00th=[  157], 80.00th=[  228], 90.00th=[  409], 95.00th=[  634],
     | 99.00th=[ 1301], 99.50th=[ 1435], 99.90th=[ 1804], 99.95th=[ 2198],
     | 99.99th=[ 2702]
   bw (  KiB/s): min=   44, max=14088, per=100.00%, avg=4347.49, stdev=910.84, samples=708
   iops        : min=    8, max= 3522, avg=1086.68, stdev=227.73, samples=708
  write: IOPS=460, BW=1841KiB/s (1885kB/s)(163MiB/90689msec); 0 zone resets
    slat (usec): min=5, max=916088, avg=1311.42, stdev=12412.69
    clat (usec): min=762, max=4633.4k, avg=140018.62, stdev=221606.99
     lat (usec): min=774, max=4633.5k, avg=141330.04, stdev=222814.76
    clat percentiles (msec):
     |  1.00th=[   10],  5.00th=[   14], 10.00th=[   20], 20.00th=[   29],
     | 30.00th=[   39], 40.00th=[   50], 50.00th=[   66], 60.00th=[   93],
     | 70.00th=[  133], 80.00th=[  194], 90.00th=[  317], 95.00th=[  489],
     | 99.00th=[ 1150], 99.50th=[ 1334], 99.90th=[ 2433], 99.95th=[ 2970],
     | 99.99th=[ 4530]
   bw (  KiB/s): min=   28, max= 6468, per=100.00%, avg=1881.31, stdev=397.39, samples=709
   iops        : min=    4, max= 1617, avg=470.16, stdev=99.36, samples=709
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.56%, 20=4.26%, 50=20.91%
  lat (msec)   : 100=28.90%, 250=28.38%, 500=10.24%, 750=3.37%, 1000=1.40%
  lat (msec)   : 2000=1.85%, >=2000=0.09%
  cpu          : usr=0.52%, sys=1.83%, ctx=120542, majf=0, minf=55
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=96399,41741,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=4252KiB/s (4354kB/s), 4252KiB/s-4252KiB/s (4354kB/s-4354kB/s), io=377MiB (395MB), run=90689-90689msec
  WRITE: bw=1841KiB/s (1885kB/s), 1841KiB/s-1841KiB/s (1885kB/s-1885kB/s), io=163MiB (171MB), run=90689-90689msec

Disk stats (read/write):
  sda: ios=96398/41858, sectors=772120/336416, merge=115/86, ticks=16806586/5710560, in_queue=22517146, util=95.80%
[+] Workload completed.
[+] Stopping monitoring...
[+] Cleaning logs...
[+] Done. Logs in run_after
Enter baseline directory path: [DEBUG] iostat columns: ['Device', 'r/s', 'rMB/s', 'rrqm/s', '%rrqm', 'r_await', 'rareq-sz', 'w/s', 'wMB/s', 'wrqm/s', '%wrqm', 'w_await', 'wareq-sz', 'd/s', 'dMB/s', 'drqm/s', '%drqm', 'd_await', 'dareq-sz', 'f/s', 'f_await', 'aqu-sz', '%util']

[+] Features extracted:
avg_await: 279.34
avg_queue: 232.16
avg_util: 91.81
avg_iops: 1433.37
avg_throughput_kBps: 6102.3
avg_iowait: 20.93
avg_req_size: 6.49
write_ratio: 0.29
top_io_process: node
top_io_kB: 2828952976.0
psi_some_avg10: 32.36
disk_pressure_score: 107.85
Enter BEFORE directory path: Enter AFTER directory path: [+] Plots saved in comparison_plots/
DONE
iiitb@iiitb-vm:~/Disk$